classes = '[{"class_name" : "ECE 5. Introduction to Electrical and Computer Engineering", "school": "UCSD","detail": "An introduction to electrical and computer engineering. Topics include circuit theory, assembly, and testing, embedded systems programming and debugging, transducer mechanisms and interfacing transducers, signals and systems theory, digital signal processing, and modular design techniques."},{"class_name" : "ECE 15. Engineering Computation",  "school": "UCSD","detail": "Students learn the C programming language with an emphasis on high-performance numerical computation. The commonality across programming languages of control structures, data structures, and I/O is also covered. Techniques for using MATLAB to graph the results of C computations are developed."},{"class_name" : "ECE 16. Rapid Hardware and Software Design for Interfacing with the World",  "school": "UCSD","detail": "Students are introduced to embedded systems concepts with structured development of a computer controller based on electromyogram (EMG) signals through four lab assignments through the quarter. Key concepts include sampling, signal processing, communication, and real-time control. Students will apply their prior knowledge in C (from ECE15) to program microcontrollers and will engage in data analysis using the Python programming language. "},{"class_name" : "ECE 17. Object-Oriented Programming: Design and Development with C++",  "school": "UCSD","detail": "This course combines the fundamentals of object-oriented design in C++, with the programming, debugging, and testing practices used by modern software developers. Emphasizes the use of object-oriented techniques to model and reason about system design, and using modern C++ idioms, design patterns, and the Standard Template Library (STL) to develop solutions to systems engineering challenges that are more reliable, robust, scalable, and secure."},{"class_name" : "ECE 25. Introduction to Digital Design",  "school": "UCSD","detail": "This course emphasizes digital electronics. Principles introduced in lectures are used in laboratory assignments, which also serve to introduce experimental and design methods. Topics include Boolean algebra, combination and sequential logic, gates and their implementation in digital circuits."},{"class_name" : "ECE 30. Introduction to Computer Engineering",  "school": "UCSD","detail": "The fundamentals of both the hardware and software in a computer system. Topics include representation of information, computer organization and design, assembly and microprogramming, current technology in logic design."},{"class_name" : "ECE 35. Introduction to Analog Design",  "school": "UCSD","detail": "Fundamental circuit theory concepts, Kirchhoff’s voltage and current laws, Thevenin’s and Norton’s theorems, loop and node analysis, time-varying signals, transient first order circuits, steady-state sinusoidal response."},{"class_name" : "ECE 45. Circuits and Systems",  "school": "UCSD","detail": "Steady-state circuit analysis, first and second order systems, Fourier Series and Transforms, time domain analysis, convolution, transient response, Laplace Transform, and filter design."},{"class_name" : "ECE 65. Components and Circuits Laboratory",  "school": "UCSD","detail": "Introduction to linear and nonlinear components and circuits. Topics will include two terminal devices, bipolar and field-effect transistors, and large and small signal analysis of diode and transistor circuits."},{"class_name" : "ECE 100. Linear Electronic Systems",  "school": "UCSD","detail": "Linear active circuit and system design. Topics include frequency response; use of Laplace transforms; design and stability of filters using operational amplifiers. Integrated lab and lecture involves analysis, design, simulation, and testing of circuits and systems."},{"class_name" : "ECE 101. Linear Systems Fundamentals",  "school": "UCSD","detail": "Complex variables. Singularities and residues. Signal and system analysis in continuous and discrete time. Fourier series and transforms. Laplace and z-transforms. Linear Time Invariant Systems. Impulse response, frequency response, and transfer functions. Poles and zeros. Stability. Convolution. Sampling. Aliasing."},{"class_name" : "ECE 102. Introduction to Active Circuit Design ",  "school": "UCSD","detail": "Nonlinear active circuits design. Nonlinear device models for diodes, bipolar and field-effect transistors. Linearization of device models and small-signal equivalent circuits. Circuit designs will be simulated by computer and tested in the laboratory."},{"class_name" : "ECE 103. Fundamentals of Devices and Materials",  "school": "UCSD","detail": "Introduction to semiconductor materials and devices. Semiconductor crystal structure, energy bands, doping, carrier statistics, drift and diffusion, p-n junctions, metal-semiconductor junctions. Bipolar junction transistors: current flow, amplification, switching, nonideal behavior. Metal-oxide-semiconductor structures, MOSFETs, device scaling."},{"class_name" : "ECE 107. Electromagnetism",  "school": "UCSD","detail": "Electrostatics and magnetostatics; electrodynamics; Maxwell’s equations; plane waves; skin effect. Electromagnetics of transmission lines: reflection and transmission at discontinuities, Smith chart, pulse propagation, dispersion. Rectangular waveguides. Dielectric and magnetic properties of materials. Electromagnetics of circuits."},{"class_name" : "ECE 109. Engineering Probability and Statistics",  "school": "UCSD","detail": "Axioms of probability, conditional probability, theorem of total probability, random variables, densities, expected values, characteristic functions, transformation of random variables, central limit theorem. Random number generation, engineering reliability, elements of estimation, random sampling, sampling distributions, tests for hypothesis."},{"class_name" : "ECE 111. Advanced Digital Design Project",  "school": "UCSD","detail": "Advanced topics in digital circuits and systems. Use of computers and design automation tools. Hazard elimination, synchronous/asynchronous FSM synthesis, synchronization and arbitration, pipelining and timing issues. Problem sets and design exercises. A large-scale design project. Simulation and/or rapid prototyping."},{"class_name" : "ECE 143. Programming for Data Analysis",  "school": "UCSD","detail": "This course covers the fundamentals of using the Python language effectively for data analysis. Students learn the underlying mechanics and implementation specifics of Python and how to effectively utilize the many built-in data structures and algorithms. The course introduces key modules for data analysis such as Numpy, Pandas, and Matplotlib. Participants learn to leverage and navigate the vast Python ecosystem to find codes and communities of individual interest."},{"class_name" : "ECE 158A. Data Networks I",  "school": "UCSD","detail": "Layered network architectures, data link control protocols and multiple-access systems, performance analysis. Flow control; prevention of deadlock and throughput degradation. Routing, centralized and decentralized schemes, static dynamic algorithms. Shortest path and minimum average delay algorithms. Comparisons."},{"class_name" : "ECE 190. Engineering Design",  "school": "UCSD","detail": "Students complete a project comprising at least 50 percent or more engineering design to satisfy the following features: student creativity, open-ended formulation of a problem statement/specifications, consideration of alternative solutions/realistic constraints. Written final report required. "},{"class_name" : "CSE 100. Advanced Data Structures (In Process)",  "school": "UCSD","detail": "High-performance data structures and supporting algorithms. Use and implementation of data structures like (un)balanced trees, graphs, priority queues, and hash tables. Also, memory management, pointers, recursion. Theoretical and practical performance analysis, both average case and amortized. Uses C++ and STL."},{"class_name" : "CSE 240A. Principles of Computer Architecture (In Process)",  "school": "UCSD","detail": "This course will cover fundamental concepts in computer architecture. Topics include instruction set architecture, pipelining, pipeline hazards, bypassing, dynamic scheduling, branch prediction, superscalar issue, memory-hierarchy design, advanced cache architectures, and multiprocessor architecture issues. "},{"class_name" : "CSE 255. Data Mining and Predictive Analytics (In Process)",  "school": "UCSD","detail": "Learning methods for applications. Content may include data preparation, regression and classification algorithms, support vector machines, random forests, class imbalance, overfitting, decision theory, recommender systems and collaborative filtering, text mining, analyzing social networks and social media, protecting privacy, A/B testing."}]';